vincent290587/nRF51/nRF51_SDK_10.0.0_dc26b5e/examples/multiprotocol/ble_ant_ancs_light/main.c
    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for handling advertising events.
 *
 * @details This function is called for advertising events that are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_DIRECTED:
            break;

        case BLE_ADV_EVT_FAST:
            break;

        case BLE_ADV_EVT_FAST_WHITELIST:
            break;

        case BLE_ADV_EVT_SLOW:
            break;

        case BLE_ADV_EVT_IDLE:
            //sleep_mode
            break;

        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
            ble_gap_whitelist_t whitelist;
            ble_gap_addr_t    * p_whitelist_addr[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            ble_gap_irk_t     * p_whitelist_irk[BLE_GAP_WHITELIST_IRK_MAX_COUNT];

            whitelist.addr_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
            whitelist.irk_count  = BLE_GAP_WHITELIST_IRK_MAX_COUNT;
            whitelist.pp_addrs   = p_whitelist_addr;
            whitelist.pp_irks    = p_whitelist_irk;

            err_code = dm_whitelist_create(&m_app_handle, &whitelist);
            APP_ERROR_CHECK(err_code);

            err_code = ble_advertising_whitelist_reply(&whitelist);
            APP_ERROR_CHECK(err_code);
            break;
        }

        default:
            break;
    }
}


/**@brief Function for handling the application's BLE stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            printf("$ANCS,0,ANCS connected\n\r");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            printf("$ANCS,0,ANCS disconnected\n\r");
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
				
#if LEDS_NUMBER > 0
            LEDS_OFF(BSP_LED_1_MASK);
            uint8_t var = 20;
            LEDS_OFF(LEDS_MASK);
            while (var--) {
              nrf_delay_ms(200);
              LEDS_INVERT(LEDS_MASK);
            }
#else
            nrf_delay_ms(100);
#endif
            break;

        case BLE_GATTC_EVT_TIMEOUT:
        case BLE_GATTS_EVT_TIMEOUT:
            LOG("Timeout.\n\r");
            // Disconnect on GATT Server and Client time-out events.
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
    app_error_handler(err_code, 0, (uint8_t*)"on_ble_evt");
}




/**@brief Function for handling bsp events.
 */
void bsp_evt_handler(bsp_event_t evt)
{

#ifdef NRF_LOG_USES_RTT
  SEGGER_RTT_printf(0, "Event: %u\n", evt); 
#endif

  
    switch (evt)
    {
        case BSP_EVENT_KEY_0:
            printf("$BTN,0\n\r");
            break;
        case BSP_EVENT_KEY_1:
            printf("$BTN,1\n\r");
            break;
        case BSP_EVENT_KEY_2:
            printf("$BTN,2\n\r");
            break;
#ifdef USE_TUNES
				case BSP_EVENT_KEY_3:
            play_mario(0);
            break;
				case BSP_EVENT_KEY_4:
            play_mario(1);
				    break;
				case BSP_EVENT_KEY_5:
            play_mario(2);
            break;
#endif
        default:
            return; // no implementation needed
    }

}

#ifdef USE_TUNES
static void pwm_start(uint32_t period_us) {
  
    /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(period_us, 24, 0);
    
    /* Switch the polarity of the second channel. */
    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;
    
    /* Initialize and enable PWM. */
    uint32_t err_code = app_pwm_init(&PWM1,&pwm1_cfg, pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    app_pwm_enable(&PWM1);
  
    pwm_ready = 0;
    while (app_pwm_channel_duty_set(&PWM1, 0, 50) == NRF_ERROR_BUSY) {
      nrf_delay_ms(1);
    }
    while (!pwm_ready) {
      nrf_delay_ms(1);
    }
    APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, 50));
    
}


static void pwm_stop() {
    app_pwm_disable(&PWM1);
    uint32_t err_code = app_pwm_uninit(&PWM1);
    APP_ERROR_CHECK(err_code);
}

static void play_mario(uint8_t which_) {
	 
	 whichTune = which_;
	
   iTune = notes_nb[whichTune];
	 if (isTunePlaying) {
		 isTunePlaying = 0;
		 pwm_stop();
		 nrf_delay_ms(10);
	 }
#ifndef DEBUG
   play_tune ();
#endif
}

static void play_tune (void) {
  
  uint32_t err_code, delay, period_us;
  
  if (iTune > 1) {
    // indice non nul
    if (isTunePlaying) {
      // on vient de jouer une note
      // on joue un blanc
      isTunePlaying = 0;
      pwm_stop();
      delay = APP_TIMER_TICKS(1000 / melodies_t[whichTune][notes_nb[whichTune] - iTune], APP_TIMER_PRESCALER);
      err_code = app_timer_start(m_sec_tune, delay, NULL);
      APP_ERROR_CHECK(err_code);
      
      iTune--;
    } else {
      // on vient de jouer un blanc ou on commence
      if (iTune - 1 > 1) {
        // on relance
        if (melodies_m[whichTune][notes_nb[whichTune] - iTune] > 0) {
          period_us = 1000000 / melodies_m[whichTune][notes_nb[whichTune] - iTune];
          pwm_start(period_us);
        }
        delay = APP_TIMER_TICKS(1300 / melodies_t[whichTune][notes_nb[whichTune] - iTune], APP_TIMER_PRESCALER);
        err_code = app_timer_start(m_sec_tune, delay, NULL);
        APP_ERROR_CHECK(err_code);
      }
      
      isTunePlaying = 1;
    }
    
